
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	УправлениеВидимостюЭлементовФормы();
	
КонецПроцедуры

&НаКлиенте
Процедура ВидНоменклатурыПриИзменении(Элемент)
	
	 УправлениеВидимостюЭлементовФормы();
	
КонецПроцедуры

&НаСервере
Процедура УправлениеВидимостюЭлементовФормы()
	
	// то, как сделано в вебинаре.
	ЭтоПосещениеАттракциона = (Объект.ВидНоменклатуры = Перечисления.ВидНоменклатуры.ПосещениеАттракциона);

	Элементы.ВидАттракциона.Видимость = ЭтоПосещениеАттракциона;
	Элементы.КоличествоПосещений.Видимость = ЭтоПосещениеАттракциона;
	
	
	// то, как сделал бы я.
//	Если Объект.ВидНоменклатуры = Перечисления.ВидНоменклатуры.ПосещениеАттракциона Тогда
//		
//		Элементы.ВидАттракциона.Видимость = Истина;
//		Элементы.КоличествоПосещений.Видимость = Истина;
//		
//	Иначе
//		
//		Элементы.ВидАттракциона.Видимость = Ложь;
//		Элементы.КоличествоПосещений.Видимость = Ложь;
//		
//	КонецЕсли;
	
КонецПроцедуры


