
// Нормализованный номер телефона.
// 
// Параметры:
//  Телефон - Строка
// 
// Возвращаемое значение: Строка
//  
Функция НормализованныйНомерТелефона(Телефон, ВызыватьИсключение = Ложь) Экспорт
	
	Цифры = "0123456789";
	
	ЦифрыТелефона = "";
	
	Для Счетчик = 1 По СтрДлина(Телефон) Цикл
		
		Символ = Сред(Телефон, Счетчик, 1); // то есть проходим по каждому символу строки по-очереди
		
		Если СтрНайти(Цифры, Символ) = 0 Тогда // если СтрНайти = 0 значит проверяемый символ НЕ цифра 
			Продолжить		
		КонецЕсли;
		
		ЦифрыТелефона = ЦифрыТелефона + Символ;
		
	КонецЦикла;
	
	Если СтрНачинаетсяС(ЦифрыТелефона, "8") Тогда
		
		// если не передаем в метод количество взятых символов
		// то он берет все символы до конца строки
		ЦифрыТелефона = "7" + Сред(ЦифрыТелефона, 2);
		
	КонецЕсли;
	
	Ошибки = Новый Массив;
	
	Если НЕ СтрНачинаетсяС(ЦифрыТелефона, "7") Тогда		
		Ошибки.Добавить("Номер телефона должен начинаться с ""7"" или ""8""");		
	КонецЕсли;
	
	Если НЕ СтрДлина(ЦифрыТелефона) = 11 Тогда
		Ошибки.Добавить("Номер телефона слишком длинный");
	КонецЕсли;
	
	Если Ошибки.Количество() > 0 Тогда
		Если ВызыватьИсключение Тогда
			ВызватьИсключение СтрСоединить(Ошибки, "; ")
		Иначе
			Возврат "";
		КонецЕсли;
	КонецЕсли;
	
	Возврат ЦифрыТелефона;
	
КонецФункции